{
  "metadata": {
    "title": "MyInvestor uses Sttok for comprehensive corporate governance management",
    "description": "MyInvestor relies on Sttok for digital management of its governing bodies, corporate documentation, and corporate processes",
    "keywords": "MyInvestor, Sttok, MyInvestor and Sttok, digital corporate governance, corporate management, sttok clients"
  },
  "summary": {
    "client": "MyInvestor",
    "title": "MyInvestor digitalizes its corporate management with Sttok",
    "description": "",
    "quote": {
      "text": "'Sttok has enabled us to digitalize and automate all our corporate management, from board meetings to maintaining the shareholder registry, ensuring maximum legal security in all our corporate processes'",
      "author": "Legal Affairs Director",
      "position": "MyInvestor"
    },
    "button": {
      "text": "Visit MyInvestor website",
      "link": "https://myinvestor.es/"
    },
    "features": [
      {
        "key": "Client",
        "value": "MyInvestor"
      },
      {
        "key": "Since",
        "value": "2023"
      },
      {
        "key": "Industry",
        "value": "Financial Services"
      },
      {
        "key": "Features",
        "value": "Board of Directors, Shareholder Registry, Document Management, Shareholders Meetings"
      }
    ]
  },
  "content": {
    "title": "MyInvestor uses Sttok",
    "image": {
      "light": "/hero/hero-testimonials-myinvestor.jpg",
      "dark": "/hero/hero-testimonials-myinvestor.jpg"
    },
    "sections": [
      {
        "title": "About MyInvestor",
        "texts": [
          "MyInvestor is a leading digital financial institution in Spain operating as an Andbank agent. It has positioned itself as one of the most innovative neobanks in the Spanish market, offering investment services, mortgages, and current accounts with highly competitive conditions.",
          "The entity has experienced exponential growth since its launch, surpassing €1 billion in assets under management and more than 125,000 clients, establishing itself as one of the main players in the Spanish fintech sector. As a regulated financial institution, MyInvestor maintains the highest standards of corporate governance and regulatory compliance."
        ]
      },
      {
        "title": "Why did they choose us?",
        "texts": [
          "1. For the need to digitalize their corporate governance processes securely and efficiently.",
          "2. For the legal security provided by the platform in document management and traceability of corporate agreements.",
          "3. For the efficiency in conducting digital board meetings and managing online voting.",
          "4. For the automation in generating corporate documentation and minutes.",
          "5. For compliance with the highest regulatory standards in the financial sector and adaptation to regulated entity regulations.",
          "6. For the ability to digitally manage the shareholder registry and corporate documentation."
        ]
      }
    ]
  }
}